# -*- coding: gbk -*-

sixtyfour_hexagrams = {
    "111111": "乾为天",
    "011111": "泽天夬",
    "101111": "火天大有",
    "001111": "雷天大壮",
    "110111": "风天小畜",
    "010111": "水天需",
    "100111": "山天大畜",
    "000111": "地天泰",
    "111011": "天泽履",
    "011011": "兑为泽",
    "101011": "火泽睽",
    "001011": "雷泽归妹",
    "110011": "风泽中孚",
    "010011": "水泽节",
    "100011": "山泽损",
    "000011": "地泽临",
    "111101": "天火同人",
    "011101": "泽火革",
    "101101": "离为火",
    "001101": "雷火丰",
    "110101": "风火家人",
    "010101": "水火既济",
    "100101": "山火贲",
    "000101": "地火明夷",
    "111001": "天雷无妄",
    "011001": "泽雷随",
    "101001": "火雷噬嗑",
    "001001": "震为雷",
    "110001": "风雷益",
    "010001": "水雷屯",
    "100001": "山雷颐",
    "000001": "地雷复",
    "111110": "天风姤",
    "011110": "泽风大过",
    "101110": "火风鼎",
    "001110": "雷风恒",
    "110110": "巽为风",
    "010110": "水风井",
    "100110": "山风蛊",
    "000110": "地风升",
    "111010": "天水讼",
    "011010": "泽水困",
    "101010": "火水未济",
    "001010": "雷水解",
    "110010": "风水涣",
    "010010": "坎为水",
    "100010": "山水蒙",
    "000010": "地水师",
    "111100": "天山遁",
    "011100": "泽山咸",
    "101100": "火山旅",
    "001100": "雷山小过",
    "110100": "风山渐",
    "010100": "水山蹇",
    "100100": "艮为山",
    "000100": "地山谦",
    "111000": "天地否",
    "011000": "泽地萃",
    "101000": "火地晋",
    "001000": "雷地豫",
    "110000": "风地观",
    "010000": "水地比",
    "100000": "山地剥",
    "000000": "坤为地",
}

paigua = {
    "111111": {
        "name": "乾",
        "nature": "鎮星",
        "element": "金",
        "palace": "乾宫",
        "base": "一世卦",
        "yongshen": {
            1: "父壬戌土世",
            2: "兄壬申金五",
            3: "官壬午火四",
            4: "父甲辰土應",
            5: "妻甲寅木二",
            6: "子甲子水初"
        }
    },
    "111110": {
        "name": "44姤",
        "nature": "太白",
        "element": "金",
        "palace": "乾宫",
        "base": "一世卦",
        "yongshen": {
            1: "父壬戌土上",
            2: "兄壬申金五",
            3: "官壬午火應",
            4: "兄辛酉金三",
            5: "子辛亥水二",
            6: "父辛丑土世"
        }
    },
    "111100": {
        "name": "33遁",
        "nature": "太陰",
        "element": "金",
        "palace": "乾宫",
        "base": "二世卦",
        "yongshen": {
            1: "父壬戌土上",
            2: "兄壬申金應",
            3: "官壬午火四",
            4: "兄丙申金三",
            5: "官丙午火世",
            6: "父丙辰土初"
        }
    },
    "111000": {
        "name": "否",
        "nature": "歲星",
        "element": "金",
        "palace": "乾宫",
        "base": "三世卦",
        "yongshen": {
            1: "父壬戌土應",
            2: "兄壬申金五",
            3: "官壬午火四",
            4: "妻乙卯木世",
            5: "官乙巳火二",
            6: "父乙未土初"
        }
    },
    '110000': {
        'name': '观',
        'nature': '荧惑',
        'element': '金',
        'palace': '乾宫',
        'base': '四世卦',
        'yongshen': {
            1: '妻辛卯木上',
            2: '官辛巳火五',
            3: '父辛未土世',
            4: '妻乙卯木三',
            5: '官乙巳火二',
            6: '父乙未土應'
        }
    },
    '100000': {
        'name': '剥',
        'nature': '鎮星',
        'element': '金',
        'palace': '乾宫',
        'base': '五世卦',
        'yongshen': {
            1: '妻丙寅木上',
            2: '子丙子水世',
            3: '父丙戌土四',
            4: '妻乙卯木三',
            5: '官乙巳火應',
            6: '父乙未土初'
        }
    },
    '101000': {
        'name': '晋',
        'nature': '太白',
        'element': '金',
        'palace': '乾宫',
        'base': '遊魂卦',
        'yongshen': {
            1: '官己巳火上',
            2: '父己未土五',
            3: '兄己酉金世',
            4: '妻乙卯木三',
            5: '官乙巳火二',
            6: '父乙未土應'
        }
    },
    '101111': {
        'name': '大有',
        'nature': '太陰',
        'element': '金',
        'palace': '乾宫',
        'base': '歸魂卦',
        'yongshen': {
            1: '官己巳火應',
            2: '父己未土五',
            3: '兄己酉金四',
            4: '父甲辰土世',
            5: '妻甲寅木二',
            6: '子甲子水初'
        }
    },
    '001001': {
        'name': '震',
        'nature': '歲星',
        'element': '木',
        'palace': '震宫',
        'base': '本宮卦',
        'yongshen': {
            1: '妻庚戌土世',
            2: '官庚申金五',
            3: '子庚午火四',
            4: '妻庚辰土應',
            5: '兄庚寅木二',
            6: '父庚子水初'
        }
    },
    '001000': {
        'name': '豫',
        'nature': '熒惑',
        'element': '木',
        'palace': '震宫',
        'base': '一世卦',
        'yongshen': {
            1: '妻庚戌土上',
            2: '官庚申金五',
            3: '子庚午火應',
            4: '兄乙卯木三',
            5: '子乙巳火二',
            6: '妻乙未土世'
        }
    },
    '001010': {
        'name': '解',
        'nature': '鎮星',
        'element': '木',
        'palace': '震宫',
        'base': '二世卦',
        'yongshen': {
            1: '妻庚戌土上',
            2: '官庚申金應',
            3: '子庚午火四',
            4: '子戊午火三',
            5: '妻戊辰土世',
            6: '兄戊寅木初'
        }
    },
    '001110': {
        'name': '恒',
        'nature': '太白',
        'element': '木',
        'palace': '震宫',
        'base': '三世卦',
        'yongshen': {
            1: '妻庚戌土應',
            2: '官庚申金五',
            3: '子庚午火四',
            4: '官辛酉金世',
            5: '父辛亥水二',
            6: '妻辛丑土初'
        }
    },
    '000110': {
        'name': '升',
        'nature': '太陰',
        'element': '木',
        'palace': '震宫',
        'base': '四世卦',
        'yongshen': {
            1: '官癸酉金上',
            2: '父癸亥水五',
            3: '妻癸丑土世',
            4: '官辛酉金三',
            5: '父辛亥水二',
            6: '妻辛丑土應'
        }
    },
    '010110': {
        'name': '井',
        'nature': '歲星',
        'element': '木',
        'palace': '震宫',
        'base': '五世卦',
        'yongshen': {
            1: '父戊子水上',
            2: '妻戊戌土世',
            3: '官戊申金四',
            4: '官辛酉金三',
            5: '父辛亥水應',
            6: '妻辛丑土初'
        }
    },
    '011110': {
        'name': '大过',
        'nature': '熒惑',
        'element': '木',
        'palace': '震宫',
        'base': '遊魂卦',
        'yongshen': {
            1: '妻丁未土上',
            2: '官丁酉金五',
            3: '父丁亥水世',
            4: '官辛酉金三',
            5: '父辛亥水二',
            6: '妻辛丑土應'
        }
    },
    '011001': {
        'name': '随',
        'nature': '鎮星',
        'element': '木',
        'palace': '震宫',
        'base': '歸魂卦',
        'yongshen': {
            1: '妻丁未土應',
            2: '官丁酉金五',
            3: '父丁亥水四',
            4: '妻庚辰土世',
            5: '兄庚寅木二',
            6: '父庚子水初'
        }
    },
    '010010': {
        'name': '坎',
        'nature': '太白',
        'element': '水',
        'palace': '坎宫',
        'base': '本宮卦',
        'yongshen': {
            1: '兄戊子水世',
            2: '官戊戌土五',
            3: '父戊申金四',
            4: '妻戊午火應',
            5: '官戊辰土二',
            6: '子戊寅木初'
        }
    },
    '010011': {
        'name': '节',
        'nature': '太陰',
        'element': '水',
        'palace': '坎宫',
        'base': '一世卦',
        'yongshen': {
            1: '兄戊子水上',
            2: '官戊戌土五',
            3: '父戊申金應',
            4: '官丁丑土三',
            5: '子丁卯木二',
            6: '妻丁巳火世'
        }
    },
    '010001': {
        'name': '屯',
        'nature': '歲星',
        'element': '水',
        'palace': '坎宫',
        'base': '二世卦',
        'yongshen': {
            1: '兄戊子水上',
            2: '官戊戌土應',
            3: '父戊申金四',
            4: '官庚辰土三',
            5: '子庚寅木世',
            6: '兄庚子水初'
        }
    },
    '010101': {
        'name': '既济',
        'nature': '熒惑',
        'element': '水',
        'palace': '坎宫',
        'base': '三世卦',
        'yongshen': {
            1: '兄戊子水應',
            2: '官戊戌土五',
            3: '父戊申金四',
            4: '兄己亥水世',
            5: '官己丑土二',
            6: '子己卯木初'
        }
    },
    '011101': {
        'name': '革',
        'nature': '鎮星',
        'element': '水',
        'palace': '坎宫',
        'base': '四世卦',
        'yongshen': {
            1: '官丁未土上',
            2: '父丁酉金五',
            3: '兄丁亥水世',
            4: '兄己亥水三',
            5: '官己丑土二',
            6: '子己卯木應'
        }
    },
    '001101': {
        'name': '丰',
        'nature': '太白',
        'element': '水',
        'palace': '坎宫',
        'base': '五世卦',
        'yongshen': {
            1: '官庚戌土上',
            2: '父庚申金世',
            3: '妻庚午火四',
            4: '兄己亥水三',
            5: '官己丑土應',
            6: '子己卯木初'
        }
    },
    '000101': {
        'name': '明夷',
        'nature': '太陰',
        'element': '水',
        'palace': '坎宫',
        'base': '遊魂卦',
        'yongshen': {
            1: '父癸酉金上',
            2: '兄癸亥水五',
            3: '官癸丑土世',
            4: '兄己亥水三',
            5: '官己丑土二',
            6: '子己卯木應'
        }
    },
    '000010': {
        'name': '师',
        'nature': '歲星',
        'element': '水',
        'palace': '坎宫',
        'base': '歸魂卦',
        'yongshen': {
            1: '父癸酉金應',
            2: '兄癸亥水五',
            3: '官癸丑土四',
            4: '妻戊午火世',
            5: '官戊辰土二',
            6: '子戊寅木初'
        }
    },
    '100100': {
        'name': '艮',
        'nature': '熒惑',
        'element': '土',
        'palace': '艮宫',
        'base': '本宮卦',
        'yongshen': {
            1: '官丙寅木世',
            2: '妻丙子水五',
            3: '兄丙戌土四',
            4: '子丙申金應',
            5: '父丙午火二',
            6: '兄丙辰土初'
        }
    },
    '100101': {
        'name': '贲',
        'nature': '鎮星',
        'element': '土',
        'palace': '艮宫',
        'base': '一世卦',
        'yongshen': {
            1: '官丙寅木上',
            2: '妻丙子水五',
            3: '兄丙戌土應',
            4: '妻己亥水三',
            5: '兄己丑土二',
            6: '官己卯木世'
        }
    },
    '100111': {
        'name': '大畜',
        'nature': '太白',
        'element': '土',
        'palace': '艮宫',
        'base': '二世卦',
        'yongshen': {
            1: '官丙寅木上',
            2: '妻丙子水應',
            3: '兄丙戌土四',
            4: '兄甲辰土三',
            5: '官甲寅木世',
            6: '妻甲子水初'
        }
    },
    '100011': {
        'name': '损',
        'nature': '太陰',
        'element': '土',
        'palace': '艮宫',
        'base': '三世卦',
        'yongshen': {
            1: '官丙寅木應',
            2: '妻丙子水五',
            3: '兄丙戌土四',
            4: '兄丁丑土世',
            5: '官丁卯木二',
            6: '父丁巳火初'
        }
    },
    '101011': {
        'name': '睽',
        'nature': '歲星',
        'element': '土',
        'palace': '艮宫',
        'base': '四世卦',
        'yongshen': {
            1: '父己巳火上',
            2: '兄己未土五',
            3: '子己酉金世',
            4: '兄丁丑土三',
            5: '官丁卯木二',
            6: '父丁巳火應'
        }
    },
    '111011': {
        'name': '履',
        'nature': '熒惑',
        'element': '土',
        'palace': '艮宫',
        'base': '五世卦',
        'yongshen': {
            1: '兄壬戌土上',
            2: '子壬申金世',
            3: '父壬午火四',
            4: '兄丁丑土三',
            5: '官丁卯木應',
            6: '父丁巳火初'
        }
    },
    '110011': {
        'name': '中孚',
        'nature': '鎮星',
        'element': '土',
        'palace': '艮宫',
        'base': '遊魂卦',
        'yongshen': {
            1: '官辛卯木上',
            2: '父辛巳火五',
            3: '兄辛未土世',
            4: '兄丁丑土三',
            5: '官丁卯木二',
            6: '父丁巳火應'
        }
    },
    '110100': {
        'name': '渐',
        'nature': '太白',
        'element': '土',
        'palace': '艮宫',
        'base': '歸魂卦',
        'yongshen': {
            1: '官辛卯木應',
            2: '父辛巳火五',
            3: '兄辛未土四',
            4: '子丙申金世',
            5: '父丙午火二',
            6: '兄丙辰土初'
        }
    },
    '000000': {
        'name': '坤',
        'nature': '太陰',
        'element': '土',
        'palace': '坤宫',
        'base': '本宮卦',
        'yongshen': {
            1: '子癸酉金世',
            2: '妻癸亥水五',
            3: '兄癸丑土四',
            4: '官乙卯木應',
            5: '父乙巳火二',
            6: '兄乙未土初'
        }
    },
    '000001': {
        'name': '复',
        'nature': '歲星',
        'element': '土',
        'palace': '坤宫',
        'base': '一世卦',
        'yongshen': {
            1: '子癸酉金上',
            2: '妻癸亥水五',
            3: '兄癸丑土應',
            4: '兄庚辰土三',
            5: '官庚寅木二',
            6: '妻庚子水世'
        }
    },
    '000011': {
        'name': '临',
        'nature': '熒惑',
        'element': '土',
        'palace': '坤宫',
        'base': '二世卦',
        'yongshen': {
            1: '子癸酉金上',
            2: '妻癸亥水應',
            3: '兄癸丑土四',
            4: '兄丁丑土三',
            5: '官丁卯木世',
            6: '父丁巳火初'
        }
    },
    '000111': {
        'name': '泰',
        'nature': '鎮星',
        'element': '土',
        'palace': '坤宫',
        'base': '三世卦',
        'yongshen': {
            1: '子癸酉金應',
            2: '妻癸亥水五',
            3: '兄癸丑土四',
            4: '兄甲辰土世',
            5: '官甲寅木二',
            6: '妻甲子水初'
        }
    },
    '001111': {
        'name': '大壮',
        'nature': '太白',
        'element': '土',
        'palace': '坤宫',
        'base': '四世卦',
        'yongshen': {
            1: '兄庚戌土上',
            2: '子庚申金五',
            3: '父庚午火世',
            4: '兄甲辰土三',
            5: '官甲寅木二',
            6: '妻甲子水應'
        }
    },
    '011111': {
        'name': '夬',
        'nature': '太陰',
        'element': '土',
        'palace': '坤宫',
        'base': '五世卦',
        'yongshen': {
            1: '兄丁未土上',
            2: '子丁酉金世',
            3: '妻丁亥水四',
            4: '兄甲辰土三',
            5: '官甲寅木應',
            6: '妻甲子水初'
        }
    },
    '010111': {
        'name': '需',
        'nature': '歲星',
        'element': '土',
        'palace': '坤宫',
        'base': '遊魂卦',
        'yongshen': {
            1: '妻戊子水上',
            2: '兄戊戌土五',
            3: '子戊申金世',
            4: '兄甲辰土三',
            5: '官甲寅木二',
            6: '妻甲子水應'
        }
    },
    '010000': {
        'name': '比',
        'nature': '熒惑',
        'element': '土',
        'palace': '坤宫',
        'base': '歸魂卦',
        'yongshen': {
            1: '妻戊子水應',
            2: '兄戊戌土五',
            3: '子戊申金四',
            4: '官乙卯木世',
            5: '父乙巳火二',
            6: '兄乙未土初'
        }
    },
    '110110': {
        'name': '巽',
        'nature': '鎮星',
        'element': '木',
        'palace': '巽宫',
        'base': '本宮卦',
        'yongshen': {
            1: '兄辛卯木世',
            2: '子辛巳火五',
            3: '妻辛未土四',
            4: '官辛酉金應',
            5: '父辛亥水二',
            6: '妻辛丑土初'
        }
    },
    '110111': {
        'name': '小畜',
        'nature': '太白',
        'element': '木',
        'palace': '巽宫',
        'base': '一世卦',
        'yongshen': {
            1: '兄辛卯木上',
            2: '子辛巳火五',
            3: '妻辛未土應',
            4: '妻甲辰土三',
            5: '兄甲寅木二',
            6: '父甲子水世'
        }
    },
    '110101': {
        'name': '家人',
        'nature': '太陰',
        'element': '木',
        'palace': '巽宫',
        'base': '二世卦',
        'yongshen': {
            1: '兄辛卯木上',
            2: '子辛巳火應',
            3: '妻辛未土四',
            4: '父己亥水三',
            5: '妻己丑土世',
            6: '兄己卯木初'
        }
    },
    '110001': {
        'name': '益',
        'nature': '歲星',
        'element': '木',
        'palace': '巽宫',
        'base': '三世卦',
        'yongshen': {
            1: '兄辛卯木應',
            2: '子辛巳火五',
            3: '妻辛未土四',
            4: '妻庚辰土世',
            5: '兄庚寅木二',
            6: '父庚子水初'
        }
    },
    '111001': {
        'name': '无妄',
        'nature': '熒惑',
        'element': '木',
        'palace': '巽宫',
        'base': '四世卦',
        'yongshen': {
            1: '妻壬戌土上',
            2: '官壬申金五',
            3: '子壬午火世',
            4: '妻庚辰土三',
            5: '兄庚寅木二',
            6: '父庚子水應'
        }
    },
    '101001': {
        'name': '噬嗑',
        'nature': '鎮星',
        'element': '木',
        'palace': '巽宫',
        'base': '五世卦',
        'yongshen': {
            1: '子己巳火上',
            2: '妻己未土世',
            3: '官己酉金四',
            4: '妻庚辰土三',
            5: '兄庚寅木應',
            6: '父庚子水初'
        }
    },
    '100001': {
        'name': '颐',
        'nature': '太白',
        'element': '木',
        'palace': '巽宫',
        'base': '遊魂卦',
        'yongshen': {
            1: '兄丙寅木上',
            2: '父丙子水五',
            3: '妻丙戌土世',
            4: '妻庚辰土三',
            5: '兄庚寅木二',
            6: '父庚子水應'
        }
    },
    '100110': {
        'name': '蛊',
        'nature': '太陰',
        'element': '木',
        'palace': '巽宫',
        'base': '歸魂卦',
        'yongshen': {
            1: '兄丙寅木應',
            2: '父丙子水五',
            3: '妻丙戌土四',
            4: '官辛酉金世',
            5: '父辛亥水二',
            6: '妻辛丑土初'
        }
    },
    '101101': {
        'name': '离',
        'nature': '歲星',
        'element': '火',
        'palace': '离宫',
        'base': '本宮卦',
        'yongshen': {
            1: '兄己巳火世',
            2: '子己未土五',
            3: '妻己酉金四',
            4: '官己亥水應',
            5: '子己丑土二',
            6: '父己卯木初'
        }
    },
    '101100': {
        'name': '旅',
        'nature': '熒惑',
        'element': '火',
        'palace': '离宫',
        'base': '一世卦',
        'yongshen': {
            1: '兄己巳火上',
            2: '子己未土五',
            3: '妻己酉金應',
            4: '妻丙申金三',
            5: '兄丙午火二',
            6: '子丙辰土世'
        }
    },
    '101110': {
        'name': '鼎',
        'nature': '鎮星',
        'element': '火',
        'palace': '离宫',
        'base': '二世卦',
        'yongshen': {
            1: '兄己巳火上',
            2: '子己未土應',
            3: '妻己酉金四',
            4: '妻辛酉金三',
            5: '官辛亥水世',
            6: '子辛丑土初'
        }
    },
    '101010': {
        'name': '未济',
        'nature': '太白',
        'element': '火',
        'palace': '离宫',
        'base': '三世卦',
        'yongshen': {
            1: '兄己巳火應',
            2: '子己未土五',
            3: '妻己酉金四',
            4: '兄戊午火世',
            5: '子戊辰土二',
            6: '父戊寅木初'
        }
    },
    '100010': {
        'name': '蒙',
        'nature': '太陰',
        'element': '火',
        'palace': '离宫',
        'base': '四世卦',
        'yongshen': {
            1: '父丙寅木上',
            2: '官丙子水五',
            3: '子丙戌土世',
            4: '兄戊午火三',
            5: '子戊辰土二',
            6: '父戊寅木應'
        }
    },
    '110010': {
        'name': '涣',
        'nature': '歲星',
        'element': '火',
        'palace': '离宫',
        'base': '五世卦',
        'yongshen': {
            1: '父辛卯木上',
            2: '兄辛巳火世',
            3: '子辛未土四',
            4: '兄戊午火三',
            5: '子戊辰土應',
            6: '父戊寅木初'
        }
    },
    '111010': {
        'name': '讼',
        'nature': '熒惑',
        'element': '火',
        'palace': '离宫',
        'base': '遊魂卦',
        'yongshen': {
            1: '子壬戌土上',
            2: '妻壬申金五',
            3: '兄壬午火世',
            4: '兄戊午火三',
            5: '子戊辰土二',
            6: '父戊寅木應'
        }
    },
    '111101': {
        'name': '同人',
        'nature': '鎮星',
        'element': '火',
        'palace': '离宫',
        'base': '歸魂卦',
        'yongshen': {
            1: '子壬戌土應',
            2: '妻壬申金五',
            3: '兄壬午火四',
            4: '官己亥水世',
            5: '子己丑土二',
            6: '父己卯木初'
        }
    },
    '011011': {
        'name': '兑',
        'nature': '太白',
        'element': '金',
        'palace': '兑宫',
        'base': '本宮卦',
        'yongshen': {
            1: '父丁未土世',
            2: '兄丁酉金五',
            3: '子丁亥水四',
            4: '父丁丑土應',
            5: '妻丁卯木二',
            6: '官丁巳火初'
        }
    },
    '011010': {
        'name': '困',
        'nature': '太陰',
        'element': '金',
        'palace': '兑宫',
        'base': '一世卦',
        'yongshen': {
            1: '父丁未土上',
            2: '兄丁酉金五',
            3: '子丁亥水應',
            4: '官戊午火三',
            5: '父戊辰土二',
            6: '妻戊寅木世'
        }
    },
    '011000': {
        'name': '萃',
        'nature': '歲星',
        'element': '金',
        'palace': '兑宫',
        'base': '二世卦',
        'yongshen': {
            1: '父丁未土上',
            2: '兄丁酉金應',
            3: '子丁亥水四',
            4: '妻乙卯木三',
            5: '官乙巳火世',
            6: '父乙未土初'
        }
    },
    '011100': {
        'name': '咸',
        'nature': '熒惑',
        'element': '金',
        'palace': '兑宫',
        'base': '三世卦',
        'yongshen': {
            1: '父丁未土應',
            2: '兄丁酉金五',
            3: '子丁亥水四',
            4: '兄丙申金世',
            5: '官丙午火二',
            6: '父丙辰土初'
        }
    },
    '010100': {
        'name': '蹇',
        'nature': '鎮星',
        'element': '金',
        'palace': '兑宫',
        'base': '四世卦',
        'yongshen': {
            1: '子戊子水上',
            2: '父戊戌土五',
            3: '兄戊申金世',
            4: '兄丙申金三',
            5: '官丙午火二',
            6: '父丙辰土應'
        }
    },
    '000100': {
        'name': '谦',
        'nature': '太白',
        'element': '金',
        'palace': '兑宫',
        'base': '五世卦',
        'yongshen': {
            1: '兄癸酉金上',
            2: '子癸亥水世',
            3: '父癸丑土四',
            4: '兄丙申金三',
            5: '官丙午火應',
            6: '父丙辰土初'
        }
    },
    "001100": {
        'name': '小过',
        'nature': '太陰',
        'element': '金',
        'palace': '兑宫',
        'base': '遊魂卦',
        'yongshen': {
            1: '父庚戌土上',
            2: '兄庚申金五',
            3: '官庚午火世',
            4: '兄丙申金三',
            5: '官丙午火二',
            6: '父丙辰土應'
        }
    },
    "001011": {
        'name': '归妹',
        'nature': '歲星',
        'element': '金',
        'palace': '兑宫',
        'base': '歸魂卦',
        'yongshen': {
            1: '父庚戌土應',
            2: '兄庚申金五',
            3: '官庚午火四',
            4: '父丁丑土世',
            5: '妻丁卯木二',
            6: '官丁巳火初'
        }
    }
}